import vlad from '../../../assets/person/vlad/vlad.png';
import lab1_1_vlad from '../../../assets/person/vlad/corel/lab1_1.png';
import lab1_2_vlad from '../../../assets/person/vlad/corel/lab1_2.png';
import lab1_3_vlad from '../../../assets/person/vlad/corel/lab1_3.png';
import lab2_1_vlad from '../../../assets/person/vlad/photoshop/lab2_1.png';
import lab2_2_vlad from '../../../assets/person/vlad/photoshop/lab2_2.png';
import lab2_3_vlad from '../../../assets/person/vlad/photoshop/lab2_3.png';
import lab3_1_vlad from '../../../assets/person/vlad/flash/lab3_1.gif';
import lab3_2_vlad from '../../../assets/person/vlad/flash/lab3_2.gif';
import lab3_3_vlad from '../../../assets/person/vlad/flash/lab3_3.gif';
import vlada from '../../../assets/person/vlada/vlada.jpg';
import lab1_1_vlada from '../../../assets/person/vlada/corel/lab1_1.jpg';
import lab1_2_vlada from '../../../assets/person/vlada/corel/lab1_2.jpg';
import lab1_3_vlada from '../../../assets/person/vlada/corel/lab1_3.jpg';
import lab2_1_vlada from '../../../assets/person/vlada/photoshop/lab2_1.jpg';
import lab2_2_vlada from '../../../assets/person/vlada/photoshop/lab2_2.jpg';
import lab2_3_vlada from '../../../assets/person/vlada/photoshop/lab2_3.jpg';
import lab3_1_vlada from '../../../assets/person/vlada/flash/lab3_1.gif';
import lab3_2_vlada from '../../../assets/person/vlada/flash/lab3_2.gif';
import lab3_3_vlada from '../../../assets/person/vlada/flash/lab3_3.gif';
import ira from '../../../assets/person/ira/ira.png';
import lab1_1_ira from '../../../assets/person/ira/corel/lab1_1.png';
import lab1_2_ira from '../../../assets/person/ira/corel/lab1_2.png';
import lab1_3_ira from '../../../assets/person/ira/corel/lab1_3.png';
import lab2_1_ira from '../../../assets/person/ira/photoshop/lab2_1.jpg';
import lab2_2_ira from '../../../assets/person/ira/photoshop/lab2_2.jpg';
import lab2_3_ira from '../../../assets/person/ira/photoshop/lab2_3.jpg';
import lab3_1_ira from '../../../assets/person/ira/flash/lab3_1.gif';
import lab3_2_ira from '../../../assets/person/ira/flash/lab3_2.gif';
import lab3_3_ira from '../../../assets/person/ira/flash/lab3_3.gif';

export const personData: PersonData[] = [
  {
    name: 'Кравченко Владислав',
    photo: vlad,
    description:
      'Это Кравченко Владислав Павлович. Он всегда старательно выполняет все лабораторные в срок. Но больше всего на свете он любит раскидывать школьников в бравл старс. Также среди его увлечений выращивание орхидей. Он очень любит ворон и пытается приручить каждую, которую встречает, с помощью арахиса',
    coreldrawProjects: [
      {
        name: 'Открытка',
        description:
          'Перечень работ открывает CorelDraw, а именно открытка на новый год. На ней мы можем видеть снеговика и зимнюю ночь, что сразу навевает приятное ощущение наступающего нового года',
        photo: lab1_1_vlad,
      },
      {
        name: 'Детский рисунок',
        description:
          'Вторая работа по CorelDraw представляет собой альт-концовку сказки волк и семеро козлят. В ней козлята не смогли избежать страшной участи...',
        photo: lab1_2_vlad,
      },
      {
        name: '3Д',
        description:
          'Последняя работа по CorelDraw -  работа с 3D. Было принято решение изобразить праздничный стол, на котором стоит запечатанный торт в виде звезды. Рисунок излучает предвкушение наступающего события.',
        photo: lab1_3_vlad,
      },
    ],
    photoshopProjects: [
      {
        name: 'Ретушь',
        description:
          'Далее необходимо было сделать работы по фотошопу, и первая из них - ретушь. Была проведена детальная работа с лицом прекрасной пожилой женщины в результате чего она стала выглядеть значительно моложе и ещё более красивее.',
        photo: lab2_1_vlad,
      },
      {
        name: 'Монтаж',
        description:
          'Следующая работа - монтаж. Тут автор решил использовать свою любимую область - бравл старс. В качестве источников был выбран красивый эпичный фон и экран предпоследней победы до тридцатого ранга. Боец, имя которой бель, была вырезана с этого скришота, вставлена на фон. Далее была проведена работа с цветом и тенью, чтобы работа смотрелась гармоничнее. В итоге получилась по истине шикарная работа',
        photo: lab2_2_vlad,
      },
      {
        name: 'Постер',
        description:
          'Последняя работа по фотошоп - постер. В качестве источников были выбраны: красивое белое помещение, символизирующее чистоту; женщина-представитель клининговой компании с телефоном в руке, с помощью которого она пытается что-то показать зрителю; новый телефон для замены в руках женщины; изображение швабр, которое было вставлено в качестве изображения в телефоне женщины. После вырезки основного героя со старого фона и вставки её на новый фон, а также работы с её телефоном, был составлен рекламный текст и сделано оформление для рекламы клининговой компании',
        photo: lab2_3_vlad,
      },
    ],
    flashProjects: [
      {
        name: 'Движение',
        description:
          'Последняя секция - работы по флэш. Первая работа - анимация движения. Тут мы можем видеть, что шрекообразный колобок радостно спускается с горы. Глубокий смысл работы поражает.',
        photo: lab3_1_vlad,
      },
      {
        name: 'Скрипт',
        description:
          'Работа самая классическая. Тут по требованиям нужно было изобразить часы, которые показывают текущее время. Для реализации такого функционала использовался ActionScript 3.0',
        photo: lab3_2_vlad,
      },
      {
        name: 'Форма',
        description:
          'Анимация формы. Автор снова решил использовать одну из своих самых любимых отраслей - выращивание цветов. Тут мы видим, как цветочек сначала растит свой стебель, а потом красиво распускается. Работа на все 100.',
        photo: lab3_3_vlad,
      },
    ],
  },
  {
    name: 'Демидовец Владислава',
    photo: vlada,
    description:
      "Это Демидовец Владислава. Мало того, что она отличный студент, она также проходит стажировку на React Frontend Developer'а. Любит супернатуралов, Resident Evil, настольные игры и впадать в дисперсию",
    coreldrawProjects: [
      {
        name: 'Открытка',
        description:
          'Первая работа авторки - открытка на хеллоуин. Были грамотно подобраны цвета, а также выбраны главные объекты изображения, что действительно погружает в spooky атмосферу праздника',
        photo: lab1_1_vlada,
      },
      {
        name: 'Детский рисунок',
        description:
          'По заданию, вторая работа - детский рисунок. Был сделан выбор в сторону вселенной Гарри Поттера, что, в результате, позволило создать мистическое настроение. В работе учтены множество деталей, что делает её поистине интересной',
        photo: lab1_2_vlada,
      },
      {
        name: '3Д',
        description:
          'Эта работа посвящена попыткам создать 3D изображение. На рисунке изображено яблоко с бликами и тенями. Использование таких элементов позволяет добиться имитации объемного изображения',
        photo: lab1_3_vlada,
      },
    ],
    photoshopProjects: [
      {
        name: 'Ретушь',
        description:
          'Теперь будут рассмотрены работы Photoshop. Здесь автор решил углубиться в одну из своих любимых областей - серия игр Resident Evil, а именно представлен любимый персонаж - Леон Кеннеди. Для выполнения этой работы была загружена рамка и фон, был вырезан персонаж и добавлены эффекты для него. Все элементы были соединены, в результате чего получился неотразимый арт-проект',
        photo: lab2_1_vlada,
      },
      {
        name: 'Монтаж',
        description:
          'Для этой работы используется фотография женщины, а в качестве фона используется какое-то непонятное древнее здание. Чтобы женщина выглядела максимально натурально на используемом фоне, была произведена работа с цветом, светом и тенью. Когда вы смотрите на эту работу сложно сказать, что на самом деле женщины не было на представленом балконе',
        photo: lab2_2_vlada,
      },
      {
        name: 'Постер',
        description:
          'Последняя работа по Photoshop - составление рекламного баннера. Для него была вырезана девушка со спортивным инвентарем и подставлена на фон, представляющий спортивный зал, что позволяет сразу же определить тематику рекламы. Затем проводилась работа со светом фона и главного объекта, выбран шрифт и цвета для него, что делает баннер максимально гармоничным и понятным',
        photo: lab2_3_vlada,
      },
    ],
    flashProjects: [
      {
        name: 'Движение',
        description:
          'Первая работа по Flash - анимация движения. Здесь мы можем видеть весеннее озерцо в Японии, в которое упал с рядом стоящего дерева цветочек сакуры. Он медленно кружит по поверхности воды, навевая оавежающее и спокойное настроение расцвета жизни.',
        photo: lab3_1_vlada,
      },
      {
        name: 'Скрипт',
        description:
          'В этой работе по Flash изображены и анимированы карманные часы, которые показываются текущее время. Для осуществления такого функционала используется скрипт.',
        photo: lab3_2_vlada,
      },
      {
        name: 'Форма',
        description:
          'На этой работе автор изобразил полное спокойствие домашней жизни тёплым летним днем. Для выполнения задания был анимирован хвост кота, изображающий удовольствие от дневного сна в тишине',
        photo: lab3_3_vlada,
      },
    ],
  },
  {
    name: 'Гребень Ирина',
    photo: ira,
    description:
      'Это Гребень Ираида - самый жизнерадостный и общительный член. Она закончила курсы по дизайну и поэтому отлично работает с ним. Ира любит приятно проводить время за просмотром фильмов и сериалов, но также вкладывает много сил в учёбу.',
    coreldrawProjects: [
      {
        name: 'Открытка',
        description:
          'В качестве первой работы автор решила создать новогоднюю открытку. На ней изображён радостный пингвиненок в шарифке, который катается на санях. На фоне мы можем наблюдать зимний лес, а также процесс падения снега. Все это позволяет прочувствовать новогоднюю атмосферу и навевает лёгкое чувство детской радости',
        photo: lab1_1_ira,
      },
      {
        name: 'Детский рисунок',
        description:
          'Вторая работа - создание детского рисунка. Мы лицезреем прекрасную попытку повторить персонажей из известного мультфильма "Смешарики" : появляется ощущение, что это действительно кадр из серии.',
        photo: lab1_2_ira,
      },
      {
        name: '3Д',
        description:
          'Создание объемного рисунка - действительно сложная работа, с которой автор прекрасно справился. На изображении показаны геометрические фигуры, которым предан объем с помощью использования теней и игры со светом.',
        photo: lab1_3_ira,
      },
    ],
    photoshopProjects: [
      {
        name: 'Ретушь',
        description:
          'Автор проделал действительно глубокую работу по ретуширования лица девушки, а также подобрал  гармонирующую с изображением рамку. Это позволило создать портрет высокого качества, который можно использовать в качестве фотографии профиля.',
        photo: lab2_1_ira,
      },
      {
        name: 'Монтаж',
        description:
          'На этой работе мы можем наблюдать собственно автора и её любимого певца - Егора Кринжа. В качестве фона был выбран красивый особняк, чтобы подчеркнуть статусность певца, а себя она поставила рядом с ним. Возникает ощущение, что Егор Кринж только пришёл домой и сразу же вручил цветы своей возлюбленной, а этот момент был запечатлен на фотографии..',
        photo: lab2_2_ira,
      },
      {
        name: 'Постер',
        description:
          'Для создания рекламы был выбран известный в Беларуси бренд "Топ". В качестве центрального элемента рассматривается клубничный коктейль. Чтобы сделать рекламу визуально "вкусной", автор использовала множество аппетитных клубничек, а также для ощущения динамичности были добавлены брызги молока. Профессиональная работа с тенью внесла финальные штрихи, сделавшие такой баннер по-настоящему конкуретнопригодным',
        photo: lab2_3_ira,
      },
    ],
    flashProjects: [
      {
        name: 'Движение',
        description:
          'Первая работа по Flash - анимация движения, представлена в виде парящей вокруг цветка пчелки. Она изменяет свою траекторию и скорость, из-за чего перемещения выглядят очень натурально',
        photo: lab3_1_ira,
      },
      {
        name: 'Скрипт',
        description:
          'Классическая работа - представление анимации часов с помощью скрипта. И ничего лишнего.',
        photo: lab3_2_ira,
      },
      {
        name: 'Форма',
        description:
          'В этой работе мы можем наблюдать сразу же две анимации. Первая - превращение мышки в кошку, вторая - появление крылышек у бабочки, а затем пархание ими. Анимации проделаны плавно, из-за чего за первращениями приятно наблюдать',
        photo: lab3_3_ira,
      },
    ],
  },
];

export interface ProjectType {
  name: string;
  description: string;
  photo: string;
}

export interface PersonData {
  name: string;
  photo: string;
  description: string;
  coreldrawProjects: ProjectType[];
  photoshopProjects: ProjectType[];
  flashProjects: ProjectType[];
}
